// nvm контроль версий в node.js дозволяє встановити
// декілька версій на один комп

// клонувати проєкт через терминал 
// git clone + ссілка которюю скопировали с гитхаба
// если что то откріто проект добавиться в тот что есть, 
// если пустой vscode будет только она

// переходим в єту папку cd cd vanilla-app-template
// Встанови базові залежності проекту в терміналі командою npm install
// после введения єтой команді додавиться папка "node_modules"
// завантажує всі пакеты 
//! Ця папка не повинна знаходитися в нашому репозиторіі на gitHub
// gitignore додаємо чи перевіряємо щоб там воно було!

//! наш проект зібраний за допомогою  VITE 
// це написано в файле package.json  "dev": "vite", 
// сайт vite 

// npm run dev запускаємо (воно установиться і буде ссилка на сайт вит ➜  Local:   http://localhost:5173/)
//ми бачимо наш проект в папці src где стандартніе 
// html, css, img, js

// щоб призупинити в терміналі проект натиснути комбинацию  ctrl+C
// заново запустити теж комбинацию  ctrl+C

// як запушити проект в свій гит хаб
// перевірити до якого аккаунту прив'язаний 
// git remote -v
// до цього: origin  https://github.com/goitacademy/vanilla-app-template.git (fetch)

// переприв'яжемо до свого
// 1) створимо у себе новий репозиторий
// 2) прив'язуємо до свого репозиторію команда:
// git remote set-url origin + ссилка на свій новій репозіторий 

// проверяем куда теперь привязан git remote -v
// теперь привязан к origin  https://github.com/Alina-Naukhatska/test.git (fetch)

//! переходимо в package.json в скрипти находимо "build" 
// далі нам треба змінити назву "build": "vite build --base=/vanilla-app-template/"
// на свою назву тобто "build": "vite build --base=/test/"

// запушимо наш проект
// git status
// git add .